In [153]:
import pandas as pd

In [154]:
raw_data = pd.read_json('../../data/Fuente1/Fuente1 - personas.json')
raw_data.head()

,DNI,Nombre,Apellidos,Ciudad,Edad,Sexo,Aficiones,Amigos
0,1111,Maria,Mendez Garcia,La Laguna,21,M,"[pintura, senderismo, natacion, pintura]","[{'DNI': 2222}, {'DNI': 4444}]"
1,2222,Carmen,Martinez Palacios,Tacoronte,22,M,"[pintura, tenis, natacion]","[{'DNI': 1111}, {'DNI': 9999}]"
2,3333,Carlos,Sanchez Diaz,Santa Cruz,18,H,"[futbol, natacion, running]","[{'DNI': 2222}, {'DNI': 5555}, {'DNI': 1111}]"
3,4444,Antonio,Perez Carrillo,Santa Cruz,25,H,"[ciclismo, running]","[{'DNI': 3333}, {'DNI': 5555}, {'DNI': 9999}]"
4,5555,Pedro,Arzola Brito,La Laguna,23,H,"[musica, lectura, running]","[{'DNI': 2222}, {'DNI': 4444}, {'DNI': 1111}]"

In [155]:
normalized_data = pd.DataFrame(columns = [
    "DNI",
    "Nombre",
    "Apellidos",
    "Ciudad_residencia",
    "Fecha_nacimiento",
    "Sexo",
    "Estatura",
    "Aficiones",
    "Amigos"
])
normalized_data

Empty DataFrame
Columns: [DNI, Nombre, Apellidos, Ciudad_residencia, Fecha_nacimiento, Sexo, Estatura, Aficiones, Amigos]
Index: []

In [156]:
# Normalizacion de DNI
normalized_data['DNI'] = raw_data['DNI']

In [157]:
# Normalizacion de Nombre
normalized_data['Nombre'] = raw_data['Nombre']

In [158]:
# Normalizacion de Apellidos
normalized_data['Apellidos'] = raw_data['Apellidos']

In [159]:
# Normalizacion de Ciudad_residencia
normalized_data['Ciudad_residencia'] = raw_data['Ciudad']

In [160]:
# Normalizacion de Fecha_nacimiento
from datetime import datetime

def convert_age(source_age):
    DEFAULT_YEAR = 1901
    today = datetime.now()
    year = today.year - int(source_age) if source_age != -1 else DEFAULT_YEAR
    
    return f'{today.day:02d}-{today.month:02d}-{year}'

normalized_data['Fecha_nacimiento'] = raw_data['Edad'].fillna(-1).apply(convert_age)

In [161]:
# Normalizacion de Sexo
normalized_data['Sexo'] = raw_data['Sexo']

In [162]:
# Normalizacion de estatura
normalized_data['Estatura'] = 0

In [163]:
# Normalizacion de aficiones
normalized_data['Aficiones'] = raw_data['Aficiones'].apply(set)

In [164]:
# Normalizacion de Amigos
normalized_data['Amigos'] = raw_data['Amigos'].apply(lambda f_list: [friend.get('DNI') for friend in f_list]).apply(set)

In [165]:
display(normalized_data)

,DNI,Nombre,Apellidos,Ciudad_residencia,Fecha_nacimiento,Sexo,Estatura,Aficiones,Amigos
0,1111,Maria,Mendez Garcia,La Laguna,29-11-2002,M,0,"{pintura, senderismo, natacion}","{4444, 2222}"
1,2222,Carmen,Martinez Palacios,Tacoronte,29-11-2001,M,0,"{pintura, tenis, natacion}","{9999, 1111}"
2,3333,Carlos,Sanchez Diaz,Santa Cruz,29-11-2005,H,0,"{futbol, running, natacion}","{5555, 2222, 1111}"
3,4444,Antonio,Perez Carrillo,Santa Cruz,29-11-1998,H,0,"{ciclismo, running}","{5555, 3333, 9999}"
4,5555,Pedro,Arzola Brito,La Laguna,29-11-2000,H,0,"{lectura, running, musica}","{4444, 2222, 1111}"
5,6666,Pilar,Dorta Gil,El Sauzal,29-11-1996,M,0,"{natacion, tenis, lectura}","{8888, 7777}"
6,7777,Luis,Mejias Rodriguez,Santa Cruz,29-11-1997,H,0,"{ciclismo, running, natacion}",{6666}
7,8888,Teresa,Vicario Diaz,Tacoronte,29-11-2000,M,0,"{running, lectura}","{6666, 4444, 1111}"
8,9999,Rosa,Cutillas Caro,Santa Cruz,29-11-2006,M,0,"{teatro, patinaje, lectura, cine}","{3333, 2222, 1111}"
9,1010,David,Mendez Prieto,Santa ursula,29-11-1994,H,0,"{lectura, bricolaje, cine}","{6666, 1020}"
10,1020,Milagros,Perdomo Gomez,La Laguna,29-11-1998,M,0,"{teatro, lectura}","{7777, 2222, 1111}"